# Stage #3: Clean and Transform

---

## Preparation

In [25]:
import pandas as pd

In [26]:
pd.set_option("display.max_columns", None)
df = pd.read_csv("C:/Users/malvi/Desktop/data-hw-Malvika-R5/Titanic/dataset_201_guide.csv")

## 1. Fill empty values in the *Embarked* column with the most common port
- **Follow-up Question:** How many Embarked values were missing?

In [27]:
df["Embarked"].isna().sum()                 # Mising value count

np.int64(2)

In [28]:
df['Embarked'].value_counts(dropna=False)   # Including missing values

Embarked
S      644
C      168
Q       77
NaN      2
Name: count, dtype: int64

In [29]:
df["Embarked"].fillna(value="S", inplace=True)
df["Embarked"].value_counts()
#df["Embarked"].isna().sum()

C:\Users\malvi\AppData\Local\Temp\ipykernel_4192\2589430260.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df["Embarked"].fillna(value="S", inplace=True)

Embarked
S    646
C    168
Q     77
Name: count, dtype: int64

---

## 2. Create a column to display rows with any missing values
- **Follow-up Question:** How many rows are missing at list one value?

In [30]:
df["has_missing"] = df.isna().any(axis=1)
df["has_missing"].value_counts()

has_missing
True     706
False    185
Name: count, dtype: int64

## 3. Create a column to display who traveled alone vs with family.
- **Follow-up Question:** How many people traveled alone?

In [31]:
df["family_size"] = df["SibSp"] + df["Parch"]
df["Alone"] = df["family_size"] == 0
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,has_missing,family_size,Alone
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,True,1,False
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,False,1,False
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,True,0,True
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,False,1,False
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,True,0,True

## 4. Create a column that displays the Surname of each passenger.
- **Follow-up Question:** What are the most common surnames?

In [32]:
df['Surname'] = df['Name'].str.split(',').str[0]
df.head(2)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,has_missing,family_size,Alone,Surname
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,True,1,False,Braund
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,False,1,False,Cumings

In [33]:
df["Surname"].value_counts()

Surname
Andersson          9
Sage               7
Skoog              6
Panula             6
Carter             6
                  ..
Najib              1
Vander Cruyssen    1
Balkic             1
van Melkebeke      1
Bystrom            1
Name: count, Length: 667, dtype: int64

## 5. Create a column that displays the Firstname of each passenger.
- **Follow-up Question:** What are the most common Firstnames?

In [34]:
df['Firstname'] = (df['Name'].str.split('.').str[1]).str.split(" ").str[1]
df.Firstname.value_counts()

Firstname
William      48
John         31
Thomas       19
George       16
Charles      16
             ..
Nourelain     1
Sigvard       1
Marin         1
Douglas       1
Jeso          1
Name: count, Length: 441, dtype: int64

## 6. Create a column to display the title of each passenger
- **Follow-up Question:** What is the usage count of each title?

In [35]:
df["Title"] = (df["Name"].str.split(".").str[0]).str.split(",").str[1]
df.head()
df["Title"].value_counts()

Title
Mr              517
Miss            182
Mrs             125
Master           40
Dr                7
Rev               6
Col               2
Mlle              2
Major             2
Ms                1
Mme               1
Don               1
Lady              1
Sir               1
Capt              1
the Countess      1
Jonkheer          1
Name: count, dtype: int64

## 7. Create an column to display the age group of each passenger.
- **Age Groups:**
  - Child: Less than 12
  - Teen: 12–17
  - Adult: 18–64
  - Senior: Greater than 64

- **Follow-up Question:** How many passengers belong to each age group?

In [36]:
bins = [0, 12, 18, 65, float("inf")]
labels = ["Child", "Teen", "Adult", "Senior"]

df["Age Group"] = pd.cut(df["Age"], bins=bins, labels=labels, right=False)

df["Age Group"].value_counts()

Age Group
Adult     590
Child      68
Teen       45
Senior     11
Name: count, dtype: int64

## 8. Create an column to display the fare category
- **Fare Category:** 
  - Low: Less than 10
  - Medium: 10–50
  - High: Greater than 50

- **Follow-up Question:** How many fares belong to each fare category?

In [37]:
bins = [0, 10, 50, float("inf")]
labels = ["Low", "Medium", "High"]

df["Fare Category"] = pd.cut(df["Fare"], bins=bins, labels=labels, right=False)

df["Fare Category"].value_counts()

Fare Category
Medium    394
Low       336
High      161
Name: count, dtype: int64

## 9. Create a column to display the family size category
- Categories:
  - Small: 1–2
  - Medium: 3–4
  - Large: 5+

- **Follow-up Question:** How many passengers belong to each category?

In [38]:
bins = [1, 3, 5, float("inf")]
labels = ["Small", "Medium", "Large"]

df["Family Size Category"] = pd.cut(df["family_size"], bins=bins, labels=labels, right=False)

df["Family Size Category"].value_counts()

Family Size Category
Small     263
Large      47
Medium     44
Name: count, dtype: int64

## 10. Create a column to display the port name

"C": "Cherbourg",
"Q": "Queenstown",
"S": "Southampton"

In [39]:
ports = {
    "C": "Cherbourg",
    "Q": "Queenstown",
    "S": "Southampton"
    }

df["Port Name"] = df["Embarked"].map(ports)
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,has_missing,family_size,Alone,Surname,Firstname,Title,Age Group,Fare Category,Family Size Category,Port Name
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,True,1,False,Braund,Owen,Mr,Adult,Low,Small,Southampton
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,False,1,False,Cumings,John,Mrs,Adult,High,Small,Cherbourg
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,True,0,True,Heikkinen,Laina,Miss,Adult,Low,NaN,Southampton
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,False,1,False,Futrelle,Jacques,Mrs,Adult,High,Small,Southampton
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,True,0,True,Allen,William,Mr,Adult,Low,NaN,Southampton

---

## 11. Rename the columns 'SibSp' and 'Parch' to more meaningful names columns
- **Follow-up Question:** How does the dataframe looks after the changes?

In [40]:
df.rename(
    columns={
        "SibSp": "SiblingsSpouses",
        "Parch": "ParentsChildren",
    },
    inplace=True,
)
df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age',
       'SiblingsSpouses', 'ParentsChildren', 'Ticket', 'Fare', 'Cabin',
       'Embarked', 'has_missing', 'family_size', 'Alone', 'Surname',
       'Firstname', 'Title', 'Age Group', 'Fare Category',
       'Family Size Category', 'Port Name'],
      dtype='object')

## 12. Remove all rows where passengers have the same surname
- OBS:
  - We previously created the column 'Surname'

- **Follow-up Questions:** 
  - How many rows were dropped?
  - What are the consequences of dropping rows?

In [41]:
# Get the original row count
original_rows = df.shape[0]

# Remove rows where passengers have the same surname, keeping the first one
surname_to_remove = df.drop_duplicates(subset=["Surname"], keep="first")

# Get the number of rows after removing duplicates
new_rows = surname_to_remove.shape[0]

# Calculate the number of dropped rows
dropped_rows = original_rows - new_rows

dropped_rows

224

In [42]:
df.shape

(891, 22)

## 13. Remove the `Ticket` and `Cabin` columns
- **Follow-up Question:** How does the dataframe looks after the changes?

In [43]:
columns_to_remove = ["Ticket", "Cabin"]

# Check the that columns we want to drop actually exist
to_drop = []
for column_name in columns_to_remove:
    if column_name in df.columns:
        df.drop(columns=to_drop, inplace=True)

df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age',
       'SiblingsSpouses', 'ParentsChildren', 'Ticket', 'Fare', 'Cabin',
       'Embarked', 'has_missing', 'family_size', 'Alone', 'Surname',
       'Firstname', 'Title', 'Age Group', 'Fare Category',
       'Family Size Category', 'Port Name'],
      dtype='object')